let User_UPN = "user@domain.com";
SigninLogs
| where ResultType == 0
| where UserPrincipalName == User_UPN
| take 1
| project UserProfile = strcat("https://portal.azure.com/#blade/Microsoft_AAD_IAM/UserDetailsMenuBlade/Profile/userId/", UserId)
