let DeviceName_ = "<Device_Name>"; 
DeviceLogonEvents
| where DeviceName == DeviceName_
| where ActionType == "LogonSuccess" 
| where LogonType == "Interactive"
| where InitiatingProcessCommandLine has "lsass.exe"
| project TimeGenerated, DeviceName, AccountName, LogonType, InitiatingProcessCommandLine
| sort by TimeGenerated desc
