let UserPrincipalName_ = "user@domain.com";
SigninLogs
| where UserPrincipalName has UserPrincipalName_
| summarize arg_max(TimeGenerated, *) by UserPrincipalName
| project TimeGenerated,
          UserPrincipalName,
          AppDisplayName,
          IPAddress,
          Location = LocationDetails,
          DeviceDetail,
          ConditionalAccessStatus,
          UserType
