let User_UPN = "user@domain.com";
SigninLogs
| where TimeGenerated > ago(30d)
| where UserPrincipalName == User_UPN
| summarize AppAccessCount = count() by AppDisplayName
| where isnotempty(AppDisplayName)
| top 50 by AppAccessCount desc
