let UserPrincipalName_ = "user@domain.com"; 
OfficeActivity 
| where RecordType == "SharePointFileOperation" 
| where UserId has UserPrincipalName_ and Operation in ("FileAccessed", "FileDownloaded")
| project TimeGenerated, UserId, Operation, SourceFileName, Site_Url, OfficeWorkload, ClientIP
