let Sender_ = "user@domain.com";
EmailEvents
| where SenderFromAddress == Sender_ and EmailDirection == "Outbound"
| project TimeGenerated, RecipientEmailAddress, Subject, ThreatTypes, DetectionMethods
| sort by TimeGenerated desc
