let Sender_ = "user@domain.com";
EmailAttachmentInfo
| where TimeGenerated > ago(30d)
| where SenderFromAddress has Sender_
| project FileName, FileType, SHA256, SenderFromAddress, RecipientEmailAddress
