// Detect delegation of Managed Service Accounts that link to high privilege accounts
// Description: Detects potential abuse of Directory Managed Service Accounts

SecurityEvent
| where EventID == 5136
| where EventData has "<Data Name=\"ObjectClass\">msDS-DelegatedManagedServiceAccount</Data>"
| where EventData has "<Data Name=\"AttributeLDAPDisplayName\">msDS-ManagedAccountPrecedeByLink</Data>"
| extend AttributeValue = extract(@"<Data Name=\"AttributeValue\">([^<]*)<>", 1, EventData)
| extend IsHighRisk = iff(tolower(AttributeValue) has "admin", true, false)
