// This KQL tracks password change/reset events
AuditLogs
| where TimeGenerated >= ago(30d)
| where OperationName in~ ("Change user password", "Reset user password")
| project TimeGenerated, OperationName, InitiatedBy = tostring(InitiatedBy.user.userPrincipalName), TargetUser = tostring(TargetResources[0].userPrincipalName)
| summarize LastPasswordChange = max(TimeGenerated) by TargetUser